#### Terraform Prod Format and Style 🖌 `success`
#### Terraform Prod Initialization ⚙️ `success`
#### Terraform Prod Validation 🤖 `success`
<details><summary>Prod Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Prod Plan 📖 `success`

<details><summary>Show Prod Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 1s [id=6351660006196088]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be created
  + resource "databricks_job" "batch_inference_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-jeanne2_mlops_stacks-batch-inference-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/jeannefukumaru/jeanne2_mlops_stacks"
        }

      + new_cluster {
          + custom_tags                  = {
              + "clusterSource" = "mlops-stack/0.0"
            }
          + data_security_mode           = "SINGLE_USER"
          + driver_instance_pool_id      = (known after apply)
          + driver_node_type_id          = (known after apply)
          + enable_elastic_disk          = (known after apply)
          + enable_local_disk_encryption = (known after apply)
          + node_type_id                 = "Standard_D3_v2"
          + num_workers                  = 3
          + single_user_name             = "962e992a-8e76-4e1d-9acf-71ba76f5af88"
          + spark_version                = "11.0.x-cpu-ml-scala2.12"
        }

      + notebook_task {
          + base_parameters = {
              + "env"               = "prod"
              + "input_table_name"  = ""
              + "output_table_name" = "jeanne2mlopsstacks_predictions"
            }
          + notebook_path   = "notebooks/BatchInference"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 11 * * ?"
          + timezone_id            = "UTC"
        }
    }

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-jeanne2_mlops_stacks-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/jeannefukumaru/jeanne2_mlops_stacks"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + single_user_name             = "962e992a-8e76-4e1d-9acf-71ba76f5af88"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env"                = "prod"
                  + "experiment_name"    = "/jeanne2_mlops_stacks/prod-jeanne2_mlops_stacks-experiment"
                  + "model_name"         = "prod-jeanne2_mlops_stacks-model"
                  + "training_data_path" = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                }
              + notebook_path   = "notebooks/TrainWithFeatureStore"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "prod"
                }
              + notebook_path   = "notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_job.write_feature_table_job will be created
  + resource "databricks_job" "write_feature_table_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-jeanne2_mlops_stacks-write-feature-table-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/jeannefukumaru/jeanne2_mlops_stacks"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "PickupFeatures"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env"                       = "prod"
                  + "features_transform_module" = "pickup_features"
                  + "input_end_date"            = ""
                  + "input_start_date"          = ""
                  + "input_table_path"          = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                  + "output_table_name"         = "feature_store_taxi_example.trip_pickup_features"
                  + "primary_keys"              = "zip"
                  + "timestamp_column"          = "tpep_pickup_datetime"
                }
              + notebook_path   = "notebooks/GenerateAndWriteFeatures"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "DropoffFeatures"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env"                       = "prod"
                  + "features_transform_module" = "dropoff_features"
                  + "input_end_date"            = ""
                  + "input_start_date"          = ""
                  + "input_table_path"          = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                  + "output_table_name"         = "feature_store_taxi_example.trip_dropoff_features"
                  + "primary_keys"              = "zip"
                  + "timestamp_column"          = "tpep_dropoff_datetime"
                }
              + notebook_path   = "notebooks/GenerateAndWriteFeatures"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for jeanne2_mlops_stacks project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/jeanne2_mlops_stacks/prod-jeanne2_mlops_stacks-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "prod-jeanne2_mlops_stacks-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.batch_job_permissions will be created
  + resource "databricks_permissions" "batch_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.feature_job_permissions will be created
  + resource "databricks_permissions" "feature_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + jeanne2_mlops_stacks_batch_inference_job_id = (known after apply)
  + jeanne2_mlops_stacks_experiment_id          = (known after apply)
  + jeanne2_mlops_stacks_experiment_name        = "/jeanne2_mlops_stacks/prod-jeanne2_mlops_stacks-experiment"
  + jeanne2_mlops_stacks_model_name             = "prod-jeanne2_mlops_stacks-model"
  + jeanne2_mlops_stacks_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>